from aiogram import Bot, Dispatcher
from aiogram.contrib.fsm_storage.memory import MemoryStorage
from database.data import Database

db = Database("data.db")
# ___________________________________________________________________
admin_id = []  # Сюда вставляем всех админов через запятую [123123, 837148, 12312] или только одного [123]
verification = True  # True - если хотите поставить проверку на человека
token = ""  # токен бота


shop_name = ""  # название шопа
admin_chat = ""  # username админа для связи без @
feedback_link = ""  # ссылка на канал с отзывами

qiwi = ""  # телефон киви или ник
card = ""  # номер карты
bitcoin = ""  # адрес битка
# ___________________________________________________________________

any_data = {"city_key": {"Москва": "moskow_zone",
                         "С. Петербург": "sankt_zone",
                         "Казань": "kazan_zone",
                         "Екатеринбург": "ekb_zone",
                         "Сочи": "sochi_zone",
                         "Краснодар": "krasnodar_zone",
                         "Новосибирск": "Novosiborsk_zone",
                         "Бердск":"Berdck_zone"},

            "city": {"Москва", "С. Петербург", "Казань", "Екатеринбург", "Сочи", "Краснодар","Новосибирск","Бердск"},

            "zone": {"Измайлово": "1", "Внуково": "1", "Сокольники": "1", "Кунцево": "1", "Крюково": "1", "Лефортово": "1", "Выхино": "1",
                     "Медведково": "1", "Щукино": "1", "Якиманка": "1", "Невский": "1", "Петроградский": "1", "Василеостровской": "1",
                     "Советский": "1", "Приволжский": "1", "Вахитовский": "1", "Ново-Савиновский": "3", "Московский": "1",
                     "Верх-Исетский": "1", "Кировский": "1", "Железнодорожный": "4", "Ленинский": "4", "Октябрьский": "1",
                     "Адлерский": "1", "Хостинский": "1", "Лазаревский": "1", "Западный": "1", "Прикубанский": "1", "Карасунский": "1", "Центральный": "1",
                     "Дзержинский": "1","Ленинский": "1", "Первомайский":"1", "Заельцовский": "1",
                     "Квартал 11": "1","Квартал 18": "1","Центральный":"1"},

            "city_zone": {"Москва": ["Измайлово", "Внуково", "Сокольники", "Кунцево", "Крюково", "Лефортово", "Выхино", "Медведково", "Щукино", "Якиманка"],
                          "С. Петербург": ["Центральный", "Невский", "Кировский", "Московский", "Петроградский", "Василеостровской"],
                          "Казань": ["Советский", "Кировский", "Приволжский", "Вахитовский", "Ново-Савиновский", "Московский"],
                          "Екатеринбург": ["Верх-Исетский", "Кировский", "Железнодорожный", "Ленинский", "Октябрьский"],
                          "Сочи": ["Центральный", "Адлерский", "Хостинский", "Лазаревский"],
                          "Краснодар": ["Западный", "Прикубанский", "Карасунский", "Центральный"],
                          "Новосибирск": ["Дзержинский","Октябрьский","Центральный","Железнодорожный","Ленинский","Первомайский","Кировский","Заельцовский","Советский"],
                          "Бердск": ["Квартал 11","Квартал 18","Центральный"]},

            "product": {"1": ["Alpha PVP", "Гашиш Euro", "Амфетамин", "Шишки (АК47)", "Мефедрон", "Героин HQ", "Росыпь", "Шишко-План"],
                        "2": ["Alpha PVP", "Гашиш Euro", "Амфетамин", "Шишки (АК47)"],
                        "3": ["Alpha PVP", "Гашиш Euro", "Амфетамин", "Мефедрон", "Росыпь", "Героин HQ"],
                        "4": ["Alpha PVP", "Гашиш Euro", "Амфетамин", "Мефедрон", "Росыпь", "Героин HQ"],
                        "5": ["Alpha PVP", "Гашиш Euro", "Амфетамин", "Росыпь"],
                        "6": ["Alpha PVP", "Амфетамин"]},

            "product_price": {"Alpha PVP": ['0.3г (900 руб)', '0.5г (1300 руб)', '1г (2200 руб)', '3г (5500 руб)'],
                              "Гашиш Euro": ['1г (1700 руб)', '2г (2700 руб)', '5г (6000 руб)', '10г (9000 руб)'],
                              "Амфетамин": ['1г (1950 руб)', '2г (2600 руб)', '5г (4500 руб)', '10г (8000 руб)'],
                              "Шишки (АК47)": ['1г (1800 руб)', '2г (3000 руб)', '5г (4500 руб)'],
                              "Мефедрон": ['1г (1400 руб)', '2г (2200 руб)', '5г (4500 руб)'],
                              "Героин HQ": ['0.5 (2500 руб)'],
                              "Росыпь": ['1г (900 руб)', '2г (1400 руб)', '5г (3300 руб)'],
                              "Шишко-План": ['1г (900 руб)', '3г (1800 руб)']},

            "price": {'0.3г (900 руб)', '0.5г (1300 руб)', '1г (2200 руб)', '3г (5500 руб)',
                      '1г (1700 руб)', '2г (2700 руб)', '5г (6000 руб)', '10г (9000 руб)',
                      '1г (1950 руб)', '2г (2600 руб)', '5г (4500 руб)', '10г (8000 руб)',
                      '1г (1800 руб)', '2г (3000 руб)', '5г (4500 руб)',
                      '1г (1400 руб)', '2г (4000 руб)', '5г (8000 руб)', '0.5 (1700 руб)',
                      '1г (900 руб)', '3г (1800 руб)'}

            }  # в price должны быть все цены(без повторений) из product_price


bot = Bot(token=token)
storage = MemoryStorage()
dp = Dispatcher(bot, storage=storage)